/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package Entities;

import java.util.Arrays;
import java.util.List;

/**
 *
 * @author la_merde
 */
public class Data {
    public static String[] positions = {"менеджер","офисный планктон","продавец","грузчик","сисадмин","Антон"};
    
    static String adres = "587 Gates Drive \n" +
    "Southgate, MI 48195\n" +
    "7759 Cambridge Drive \n" +
    "Manchester, NH 03102\n" +
    "56 Manor Station St. \n" +
    "Fairmont, WV 26554\n" +
    "151 Primrose Court \n" +
    "Oconomowoc, WI 53066\n" +
    "8370 Newport Ave. \n" +
    "New Windsor, NY 12553\n" +
    "9389 Locust St. \n" +
    "Chicago, IL 60621\n" +
    "8529 Littleton Road \n" +
    "Fayetteville, NC 28303\n" +
    "7 Oakwood St. \n" +
    "Bowie, MD 20715\n" +
    "805 York Street \n" +
    "Aiken, SC 29803\n" +
    "40 Cooper Ave. \n" +
    "Raeford, NC 28376\n" +
    "8303 Surrey Dr. \n" +
    "Chester, PA 19013\n" +
    "73 Overlook Street \n" +
    "Hopkinsville, KY 42240\n" +
    "2 Cedar Swamp St. \n" +
    "Butler, PA 16001\n" +
    "425 Oak St. \n" +
    "North Royalton, OH 44133\n" +
    "96 North Border Ave. \n" +
    "Barberton, OH 44203\n" +
    "526 Windfall Ave. \n" +
    "Silver Spring, MD 20901\n" +
    "378 Sycamore St. \n" +
    "Vernon Rockville, CT 06066\n" +
    "27 Orchard Drive \n" +
    "Arlington Heights, IL 60004\n" +
    "8186 Woodland St. \n" +
    "East Elmhurst, NY 11369\n" +
    "7 East Colonial Drive \n" +
    "Massapequa Park, NY 11762\n" +
    "280 Bow Ridge St. \n" +
    "Fremont, OH 43420\n" +
    "7066 W. Hill Field Drive \n" +
    "North Ridgeville, OH 44039\n" +
    "40 Maple Street \n" +
    "Decatur, GA 30030\n" +
    "26 Glenwood St. \n" +
    "Suite I \n" +
    "Ottumwa, IA 52501\n" +
    "355 Division Drive \n" +
    "Haines City, FL 33844\n" +
    "7974 Theatre St. \n" +
    "Anaheim, CA 92806\n" +
    "9206 Mayfair Avenue \n" +
    "Scotch Plains, NJ 07076\n" +
    "13 Ridgeview St. \n" +
    "Danvers, MA 01923\n" +
    "8558 Old Proctor Street \n" +
    "Taunton, MA 02780\n" +
    "942 Winding Way Street \n" +
    "Helotes, TX 78023\n" +
    "8151 Atlantic Street \n" +
    "San Carlos, CA 94070\n" +
    "9326 East William Avenue \n" +
    "Ephrata, PA 17522\n" +
    "903 Edgefield Ave. \n" +
    "Drexel Hill, PA 19026\n" +
    "35 Leatherwood Dr. \n" +
    "Ridgewood, NJ 07450\n" +
    "969 Briarwood St. \n" +
    "Lake Mary, FL 32746\n" +
    "885 La Sierra Drive \n" +
    "Tuckerton, NJ 08087\n" +
    "3 Brook Dr. \n" +
    "South Ozone Park, NY 11420\n" +
    "7988 Olive Lane \n" +
    "Decatur, GA 30030\n" +
    "9522 Big Rock Cove Dr. \n" +
    "Huntersville, NC 28078\n" +
    "8476 Whitemarsh St. \n" +
    "Mc Lean, VA 22101\n" +
    "595 W. Miles Drive \n" +
    "Atwater, CA 95301\n" +
    "694 Theatre St. \n" +
    "Chevy Chase, MD 20815\n" +
    "72 Sherwood Ave. \n" +
    "Malvern, PA 19355\n" +
    "196 York Court \n" +
    "West Orange, NJ 07052\n" +
    "5 E. Cherry St. \n" +
    "Mobile, AL 36605\n" +
    "9488 Ohio Dr. \n" +
    "Hollywood, FL 33020\n" +
    "54 Oak Valley Lane \n" +
    "Waukesha, WI 53186\n" +
    "371 Oak Valley St. \n" +
    "Potomac, MD 20854\n" +
    "506 E. Military Lane \n" +
    "High Point, NC 27265\n" +
    "226 Willow Court \n" +
    "Upland, CA 91784";
        public static String[] addreses = adres.split("\n");
  
    static String phnum = "0491 570 156\n" +
"0491 570 157\n" +
"0491 570 158\n" +
"0491 570 159\n" +
"0491 570 110\n" +
"+61 491 570 156\n" +
"+61 491 570 157\n" +
"+61 491 570 158\n" +
"+61 491 570 159\n" +
"+61 491 570 110";
      public static String[] numbers = phnum.split("\n");
      
    static String dob = "1959-11-19\n" +
"1961-08-16\n" +
"1964-03-07\n" +
"1964-03-26\n" +
"1968-01-17\n" +
"1968-05-01\n" +
"1969-12-26\n" +
"1972-12-24\n" +
"1974-03-12\n" +
"1974-10-30\n" +
"1974-12-18\n" +
"1976-10-09\n" +
"1977-01-19\n" +
"1981-04-26\n" +
"1982-12-20\n" +
"1983-12-22\n" +
"1985-03-04\n" +
"1985-04-07\n" +
"1986-10-31\n" +
"1992-02-20\n" +
"1994-02-13\n" +
"1995-07-12\n" +
"1996-07-07\n" +
"1998-01-12\n" +
"2000-05-01";
    public static String[] dobs = dob.split("\n");
    
    public static String[] names = {"Аким","Александр","Алексей","Анатолий","Андрей","Антон","Аркадий","Арсений","Артём","Артемий",
        "Богдан","Богдан","Борис","Борислав"}; //14
    
    static String surnamesStr = "Иванов\n" +
    "Васильев\n" +
    "Петров\n" +
    "Смирнов\n" +
    "Михайлов\n" +
    "Фёдоров\n" +
    "Соколов\n" +
    "Яковлев\n" +
    "Попов\n" +
    "Андреев\n" +
    "Алексеев\n" +
    "Александров\n" +
    "Лебедев\n" +
    "Григорьев\n" +
    "Степанов\n" +
    "Семёнов\n" +
    "Павлов\n" +
    "Богданов\n" +
    "Николаев\n" +
    "Дмитриев\n" +
    "Егоров\n" +
    "Волков\n" +
    "Кузнецов\n" +
    "Никитин\n" +
    "Соловьёв\n" +
    "Тимофеев\n" +
    "Орлов\n" +
    "Афанасьев\n" +
    "Филиппов\n" +
    "Сергеев\n" +
    "Захаров\n" +
    "Матвеев\n" +
    "Виноградов\n" +
    "Кузьмин\n" +
    "Максимов\n" +
    "Козлов\n" +
    "Ильин\n" +
    "Герасимов\n" +
    "Марков\n" +
    "Новиков\n" +
    "Морозов";//40
public static String[] surnames = surnamesStr.split("\n");

    static String patronymicStr = "Ааронович\n" +
    "Абрамович\n" +
    "Августович\n" +
    "Авдеевич\n" +
    "Аверьянович\n" +
    "Адамович\n" +
    "Адрианович\n" +
    "Аксёнович\n" +
    "Александрович\n" +
    "Алексеевич\n" +
    "Анатольевич\n" +
    "Андреевич\n" +
    "Анисимович\n" +
    "Антипович\n" +
    "Антонович\n" +
    "Ануфриевич\n" +
    "Арсенович\n" +
    "Арсеньевич\n" +
    "Артёмович\n" +
    "Артемьевич\n" +
    "Артурович\n" +
    "Архипович\n" +
    "Афанасьевич\n" +
    "Бенедиктович\n" +
    "Богданович\n" +
    "Бориславич\n" +
    "Бориславович\n" +
    "Борисович\n" +
    "Брониславович\n" +
    "Валентинович\n" +
    "Валерианович\n" +
    "Валерьевич\n" +
    "Валерьянович\n" +
    "Васильевич\n" +
    "Венедиктович\n" +
    "Викентьевич\n" +
    "Викторович\n" +
    "Виленович\n" +
    "Вилорович\n" +
    "Витальевич\n" +
    "Владиленович\n" +
    "Владиславович\n" +
    "Владленович\n" +
    "Власович\n" +
    "Всеволодович\n" +
    "Вячеславович\n" +
    "Гавриилович\n" +
    "Гаврилович\n" +
    "Геннадиевич\n" +
    "Георгиевич\n" +
    "Герасимович\n" +
    "Германович\n" +
    "Гертрудович\n" +
    "Глебович\n" +
    "Гордеевич\n" +
    "Григорьевич\n" +
    "Гурьевич\n" +
    "Давидович\n" +
    "Давыдович\n" +
    "Даниилович\n" +
    "Данилович\n" +
    "Демидович\n" +
    "Демьянович\n" +
    "Денисович\n" +
    "Димитриевич\n" +
    "Дмитриевич\n" +
    "Дорофеевич\n" +
    "Евсеевич\n" +
    "Евстигнеевич\n" +
    "Егорович\n" +
    "Елизарович\n" +
    "Елисеевич\n" +
    "Еремеевич\n" +
    "Ермилович\n" +
    "Ермолаевич\n" +
    "Ерофеевич\n" +
    "Ефимович\n" +
    "Ефимьевич\n" +
    "Ефремович\n" +
    "Ефстафьевич\n" +
    "Жанович\n" +
    "Жоресович\n" +
    "Захарьевич\n" +
    "Зиновьевич\n" +
    "Игнатович\n" +
    "Игнатьевич\n" +
    "Игоревич\n" +
    "Измаилович\n" +
    "Изотович\n" +
    "Иларионович\n" +
    "Ильич\n" +
    "Ильясович\n" +
    "Феодосьевич\n";//92
    public static String[] patronymics = patronymicStr.split("\n");
    
  static String servicesnameStr = "Основные услуги\n" +
"Общие условия\n" +
"Профилактические работы для программного и аппаратного обеспечения\n" +
"Подготовка ПК к установке операционной системы\n" +
"Помощь в установке операционных систем\n" +
"Первичная настройка операционной системы\n" +
"Оптимизация производительности операционной системы и программного обеспечения\n" +
"Помощь в установке программного обеспечения\n" +
"Работа с данными\n" +
"Настройка и монтаж локальных сетей и доступа подключения к интернет\n" +
"Тестирование оборудования\n" +
"Установка, профилактика, ремонт, замена комплектующих компьютера\n" +
"Настройка аппаратного и программного обеспечения компьютера и периферии\n" +
"Работы, связанные с BIOS\n" +
"Работы с СУБД\n" +
"Работы со специализированнными ос\n" +
"Дополнительные услуги\n";  
public static  String[] servicesname = servicesnameStr.split("\n");

static String descriptionStr ="Нанесение термопасты, профилактика системы охлаждения процессора	\n" +
"Чистка контактов системного блока от окиси\n" +
"Чистка корпуса системного блока от пыли\n" +
"Чистка блока питания от пыли	\n" +
"Чистка и профилактика теплозащиты графической системы	\n" +
"Чистка периферийного оборудования Чистка периферийного оборудования от загрязнений.\n" +
"Проверка поверхности жесткого диска и устранение сбойных секторов\n" +
"Дефрагментация жесткого диска\n" +
"Устранение ошибок в системном реестре	\n" +
"Исправление логических ошибок на жестком диске	\n" +
"Очистка диска и операционной системы от ненужных и временных файлов\n" +
"Настройка программного обеспечения	\n" +
"Поиск вредоносного программного обеспечения (вирусов, \"программ-шпионов\", потенциально опасного ПО)\n" +
"Загрузка виртуальной ОС\n";
public static  String[] description = descriptionStr.split("\n");

List<String> arr = Arrays.asList("company a", "company b");

static String valueStr ="1800\n" +
"1600\n" +
"1550\n" +
"850\n" +
"520\n" +
"520\n" +
"490\n" +
"370\n" +
"480\n" +
"550\n" +
"450 \n" +
"300\n" +
"350\n" +
"450\n" +
"1500\n" +
"2000\n" +
"2000\n" +
"1500\n" +
"590\n" +
"720\n" +
"1100\n" +
"890\n" +
"290\n" +
"390\n" +
"690\n" +
"490\n" +
"590\n" +
"590\n" +
"570\n" +
"250\n" +
"600\n" +
"350\n" +
"50\n" +
"75\n" +
"50\n" +
"350\n" +
"250\n" +
"990\n" +
"150\n";
public static  String[] value = valueStr.split("\n");

static String representativeStr ="«Газпром»\n" +
"НК «ЛУКойл»\n" +
"НК «Роснефть»\n" +
"Сбербанк России\n" +
"РЖД\n" +
"Группа ВТБ\n" +
"«Сургутнефтегаз»\n" +
"«Магнит»\n" +
"АК «Транснефть»\n" +
"X5 Retail Group\n" +
"Группа «Интер РАО»\n" +
"«Российские сети»\n" +
"АФК «Система»\n" +
"ГК «Мегаполис»\n" +
"«Татнефть»\n" +
"«Евраз»\n" +
"Объединенная компания «Русал»\n" +
"«Башнефть»\n" +
"ГМК «Норильский никель»\n" +
"Группа НЛМК\n" +
"«НоваТЭК»\n" +
"«Аэрофлот — российские авиалинии»\n" +
"Группа «Газпромбанк»\n" +
"«Северсталь»\n" +
"«Сибур»\n" +
"«Сахалин энерджи»\n" +
"«Вымпелком»\n" +
"Магнитогорский металлургический комбинат\n" +
"Объединенная авиастроительная корпорация\n" +
"«Русгидро»\n";
public static  String[] representative = representativeStr.split("\n");
}
